-- --------------------------------------------------------
-- Host:                         127.0.0.1
-- Server version:               10.1.31-MariaDB - mariadb.org binary distribution
-- Server OS:                    Win32
-- HeidiSQL Version:             9.5.0.5196
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;


-- Dumping database structure for amnuay
CREATE DATABASE IF NOT EXISTS `amnuay` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `amnuay`;

-- Dumping structure for table amnuay.login
CREATE TABLE IF NOT EXISTS `login` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(50) NOT NULL DEFAULT '0',
  `password` varchar(50) NOT NULL DEFAULT '0',
  `role` varchar(50) NOT NULL DEFAULT '0',
  `status` varchar(50) NOT NULL DEFAULT '0',
  `name` varchar(50) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `phone` varchar(50) DEFAULT NULL,
  `gender` varchar(50) DEFAULT NULL,
  `birthday` date DEFAULT NULL,
  `work` date DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;

-- Dumping data for table amnuay.login: ~4 rows (approximately)
/*!40000 ALTER TABLE `login` DISABLE KEYS */;
INSERT INTO `login` (`id`, `username`, `password`, `role`, `status`, `name`, `address`, `phone`, `gender`, `birthday`, `work`) VALUES
	(0, 'ทดสอบระบบ', 'ทดสอบระบบ', 'ทดสอบระบบ', '1', '', 'ทดสอบระบบ', 'ทดสอบระบบ', 'ทดสอบระบบ', '2018-08-07', '2018-08-07'),
	(1, 'admin', '1234', '1', '1', 'admin', 'ที่อยู่ admin x', '191', 'ชาย', '2018-07-20', '2018-07-20'),
	(2, 'a', 'a', '2', '1', 'นาย A', 'ที่อยู่ aa', '0998094514', 'ชาย', '1995-10-15', '2018-07-20'),
	(3, 'x', 'x', '2', '1', 'xxxx', 'xxxx', 'xxx', 'ชาย', '2018-07-20', '2018-07-20');
/*!40000 ALTER TABLE `login` ENABLE KEYS */;

-- Dumping structure for table amnuay.repair
CREATE TABLE IF NOT EXISTS `repair` (
  `repair_id` int(11) NOT NULL AUTO_INCREMENT,
  `repair_date` timestamp NULL DEFAULT NULL,
  `repair_name` varchar(50) DEFAULT NULL,
  `repair_address` varchar(255) DEFAULT NULL,
  `repair_phone` varchar(11) DEFAULT NULL,
  `repair_email` varchar(50) DEFAULT NULL,
  `repair_appliances` varchar(50) DEFAULT NULL,
  `repair_product` varchar(50) DEFAULT NULL,
  `repair_brand` varchar(50) DEFAULT NULL,
  `repair_waste` varchar(255) DEFAULT NULL,
  `repair_detail` varchar(255) DEFAULT NULL,
  `repair_appointment` date DEFAULT NULL,
  `repairmen_date` date DEFAULT NULL,
  `repairmen_completion` date DEFAULT NULL,
  `repairmen_cause` varchar(255) NOT NULL DEFAULT '',
  `repairmen_expenses` decimal(10,0) DEFAULT '0',
  `repairmen_status` varchar(50) DEFAULT '1',
  `repairmen_id` varchar(50) DEFAULT '0',
  PRIMARY KEY (`repair_id`),
  KEY `repairmen_id` (`repairmen_id`)
) ENGINE=InnoDB AUTO_INCREMENT=143 DEFAULT CHARSET=utf8;

-- Dumping data for table amnuay.repair: ~18 rows (approximately)
/*!40000 ALTER TABLE `repair` DISABLE KEYS */;
INSERT INTO `repair` (`repair_id`, `repair_date`, `repair_name`, `repair_address`, `repair_phone`, `repair_email`, `repair_appliances`, `repair_product`, `repair_brand`, `repair_waste`, `repair_detail`, `repair_appointment`, `repairmen_date`, `repairmen_completion`, `repairmen_cause`, `repairmen_expenses`, `repairmen_status`, `repairmen_id`) VALUES
	(125, '2018-07-10 15:26:57', 'a', 'a', 'a', 'a', '02', '006', '100', 'a', 'a', '2018-07-10', '2018-07-26', '2018-07-26', 'ได้แล้ว', 500, '4', '2'),
	(126, '2018-07-10 15:29:55', 'q', 'q', 'q', 'q', '02', '004', '63', 'q', 'q', '2018-07-10', '2018-07-25', '2018-07-25', 'sssss', 600, '4', '2'),
	(127, '2018-07-10 15:38:58', 'a', 'a', 'a', 'a', '01', '001', '5', 'a', 'a', '2018-07-10', '2018-07-26', '2018-07-26', 'สายขาด', 500, '2', '2'),
	(128, '2018-07-10 16:46:40', 'dsadsaa', 'dsadsa\r\n				\r\n				\r\n				\r\n				\r\n				\r\n				\r\n				', 'dsad', 'dsadsa', '02', '006', '100', 'dsadsa', 'dsadsa', '2018-07-10', '2018-07-25', '2018-07-25', 'sssss', 200, '5', '2'),
	(129, '2018-08-05 15:59:20', 'อำนวย กลีบม่วง', 'กระสัง', '0998094514', 'am-nuay2010@hotmail.com', '01', '002', '24', 'เสีย', 'เอาเครื่องมือมาด้วย', '2018-08-06', '2018-07-25', '2018-07-25', 'wtf', 300, '1', '2'),
	(130, '2018-08-05 16:36:24', 've', 've', 've', 've', '04', '013', '224', 've', 've', '2018-08-27', '2018-08-06', '2018-08-06', '', 0, '1', '2'),
	(131, '2018-08-06 12:37:19', 'q', 'q', 'q', 'q', '01', '002', '23', 'q', 'q', '2018-08-06', '2018-08-06', '2018-08-06', '', 0, '3', '2'),
	(132, '2018-08-06 15:49:03', '1', '1', '1', '1', '03', '006', '165', '1', '1', '2018-08-06', '2018-08-06', '2018-08-06', '1', 1, '4', '2'),
	(133, '2018-08-06 16:04:47', 'sa', 'sa', 'sa', 'sa', '02', '006', '101', 'sa', 'sa', '2018-08-06', '2018-08-07', '2018-08-07', 'sss', 0, '4', '2'),
	(134, '2018-08-06 16:58:29', 'ww', 'ww', 'ww', 'ww', '04', '013', '225', 'ww', 'ww', '2018-08-07', '2018-08-17', '2018-08-09', 'dsadsadsa', 100, '6', '2'),
	(135, '2018-08-06 17:07:52', 'dsadsa', 'dsadsa', 'dsadsa', 'dsadsa', '02', '004', '62', 'dsadsa', 'dsadsa', '2018-08-06', '2018-08-06', '2018-08-06', 'ซื้อใหม่ ', 100, '4', '2'),
	(136, '2018-08-06 20:12:06', 'sa', '				sa\r\n				', 'sa', 'sa', '03', '010', '164', 'sa', 'sa', '2018-08-06', '2018-08-06', '2018-08-06', 'xxxxx', 0, '2', '2'),
	(137, '2018-08-11 16:20:59', 'อำนวย กลีบม่วง', '129/2 บ้านหนองขอน', '0998094514', 'amnuay.kle@bru.ac.th', '01', '002', '26', 'มันไม่เย็น', 'ไม่มี', '2018-08-13', '2018-08-11', '2018-08-11', 'เปลี่ยนแก็ส', 300, '4', '2'),
	(138, '2018-08-13 15:06:12', 'นายสกล', 'ประโคนชัย', '08051512312', 'kkkkkkkkkkkkkkkk@ga.com', '03', '010', '182', 'ไฟไม่ติด', 'เอาหลอดไฟมาด้วย', '2018-08-13', '2018-08-13', '2018-08-13', 'ได้แล้ว', 300, '4', '2'),
	(139, '2018-08-13 15:08:21', 'aaaaaaa', 'aaaaaaaaa', 'aaaaaaaa', 'aaaaaaaa', '01', '001', '14', 'aaaa', 'aaaaaa', '2018-08-13', NULL, NULL, '', 0, '1', '0'),
	(140, '2018-08-13 16:58:39', 'test', 'test', 'test', 'test', '01', '001', '12', 'test', 'test', '2018-08-13', NULL, NULL, '', 0, '1', '0'),
	(141, '2018-08-13 16:58:39', 'test', 'test', 'test', 'test', '01', '001', '12', 'test', 'test', '2018-08-13', NULL, NULL, '', 0, '1', '0'),
	(142, '2018-08-13 17:01:00', 'test', 'test', 'test', 'test', '02', '004', '71', 'test', 'test', '2018-08-13', '2018-08-15', '2018-08-15', 'test', 100, '4', '2');
/*!40000 ALTER TABLE `repair` ENABLE KEYS */;

-- Dumping structure for table amnuay.repair_status
CREATE TABLE IF NOT EXISTS `repair_status` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(50) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;

-- Dumping data for table amnuay.repair_status: ~6 rows (approximately)
/*!40000 ALTER TABLE `repair_status` DISABLE KEYS */;
INSERT INTO `repair_status` (`id`, `name`) VALUES
	(1, 'รอตรวจสอบ'),
	(2, 'ส่งซ่อม'),
	(3, 'นำกลับมาซ่อม'),
	(4, 'ซ่อมเสร็จแล้ว'),
	(5, 'ซ่อมไม่ได้'),
	(6, 'ยกเลิก');
/*!40000 ALTER TABLE `repair_status` ENABLE KEYS */;

-- Dumping structure for table amnuay.role
CREATE TABLE IF NOT EXISTS `role` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(50) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;

-- Dumping data for table amnuay.role: ~2 rows (approximately)
/*!40000 ALTER TABLE `role` DISABLE KEYS */;
INSERT INTO `role` (`id`, `name`) VALUES
	(1, 'หัวหน้าช่าง'),
	(2, 'พนักงาน');
/*!40000 ALTER TABLE `role` ENABLE KEYS */;

-- Dumping structure for table amnuay.status_repairmen
CREATE TABLE IF NOT EXISTS `status_repairmen` (
  `id` int(11) NOT NULL,
  `name` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- Dumping data for table amnuay.status_repairmen: ~2 rows (approximately)
/*!40000 ALTER TABLE `status_repairmen` DISABLE KEYS */;
INSERT INTO `status_repairmen` (`id`, `name`) VALUES
	(1, 'ใช้งาน'),
	(2, 'เลิกใช้งาน');
/*!40000 ALTER TABLE `status_repairmen` ENABLE KEYS */;

-- Dumping structure for table amnuay.type_appliances
CREATE TABLE IF NOT EXISTS `type_appliances` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(50) DEFAULT NULL,
  `appliances_id` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8;

-- Dumping data for table amnuay.type_appliances: ~5 rows (approximately)
/*!40000 ALTER TABLE `type_appliances` DISABLE KEYS */;
INSERT INTO `type_appliances` (`id`, `name`, `appliances_id`) VALUES
	(1, 'เครื่องทำความเย็น', '01'),
	(2, 'เครื่องทำความร้อน', '02'),
	(3, 'ให้แสงสว่าง', '03'),
	(4, 'ให้ความบันเทิง', '04'),
	(5, 'มอเตอร์และสายพาน', '05');
/*!40000 ALTER TABLE `type_appliances` ENABLE KEYS */;

-- Dumping structure for table amnuay.type_brand
CREATE TABLE IF NOT EXISTS `type_brand` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(50) DEFAULT NULL,
  `product` varchar(50) DEFAULT NULL,
  `appliances` varchar(50) DEFAULT NULL,
  `appliances_id` varchar(50) DEFAULT NULL,
  `product_id` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=339 DEFAULT CHARSET=utf8;

-- Dumping data for table amnuay.type_brand: ~339 rows (approximately)
/*!40000 ALTER TABLE `type_brand` DISABLE KEYS */;
INSERT INTO `type_brand` (`id`, `name`, `product`, `appliances`, `appliances_id`, `product_id`) VALUES
	(1, 'Haier', 'แอร์', 'เครื่องทำความเย็น', '01', '001'),
	(2, 'Gree', 'แอร์', 'เครื่องทำความเย็น', '01', '001'),
	(3, 'Natural', 'แอร์', 'เครื่องทำความเย็น', '01', '001'),
	(4, 'MITSUTA', 'แอร์', 'เครื่องทำความเย็น', '01', '001'),
	(5, 'Mitsui', 'แอร์', 'เครื่องทำความเย็น', '01', '001'),
	(6, 'Central Air', 'แอร์', 'เครื่องทำความเย็น', '01', '001'),
	(7, 'Mitsubishi Heavy Duty', 'แอร์', 'เครื่องทำความเย็น', '01', '001'),
	(8, 'Daikin', 'แอร์', 'เครื่องทำความเย็น', '01', '001'),
	(9, 'SKG', 'แอร์', 'เครื่องทำความเย็น', '01', '001'),
	(10, 'Mitsubishi Electric', 'แอร์', 'เครื่องทำความเย็น', '01', '001'),
	(11, 'Panasonic', 'แอร์', 'เครื่องทำความเย็น', '01', '001'),
	(12, 'Sonar', 'แอร์', 'เครื่องทำความเย็น', '01', '001'),
	(13, 'shop108', 'แอร์', 'เครื่องทำความเย็น', '01', '001'),
	(14, 'แอลจี', 'แอร์', 'เครื่องทำความเย็น', '01', '001'),
	(15, 'Aconatic', 'แอร์', 'เครื่องทำความเย็น', '01', '001'),
	(16, 'Focus', 'แอร์', 'เครื่องทำความเย็น', '01', '001'),
	(17, 'SAIJO DENKI', 'แอร์', 'เครื่องทำความเย็น', '01', '001'),
	(18, 'Hatari', 'แอร์', 'เครื่องทำความเย็น', '01', '001'),
	(19, 'Amena', 'แอร์', 'เครื่องทำความเย็น', '01', '001'),
	(20, 'Imarflex', 'แอร์', 'เครื่องทำความเย็น', '01', '001'),
	(21, 'ซัมซุง', 'ตู้เย็น ', 'เครื่องทำความเย็น', '01', '002'),
	(22, 'Toshiba', 'ตู้เย็น ', 'เครื่องทำความเย็น', '01', '002'),
	(23, 'Sharp', 'ตู้เย็น ', 'เครื่องทำความเย็น', '01', '002'),
	(24, 'Mitsubishi', 'ตู้เย็น ', 'เครื่องทำความเย็น', '01', '002'),
	(25, 'Aconatic', 'ตู้เย็น ', 'เครื่องทำความเย็น', '01', '002'),
	(26, 'Panasonic', 'ตู้เย็น ', 'เครื่องทำความเย็น', '01', '002'),
	(27, 'Hitachi', 'ตู้เย็น ', 'เครื่องทำความเย็น', '01', '002'),
	(28, 'shop108', 'ตู้เย็น ', 'เครื่องทำความเย็น', '01', '002'),
	(29, 'แอลจี', 'ตู้เย็น ', 'เครื่องทำความเย็น', '01', '002'),
	(30, 'ไม่มี', 'ตู้เย็น ', 'เครื่องทำความเย็น', '01', '002'),
	(31, 'ALCO', 'ตู้เย็น ', 'เครื่องทำความเย็น', '01', '002'),
	(32, 'Mirage', 'ตู้เย็น ', 'เครื่องทำความเย็น', '01', '002'),
	(33, 'Hot Item', 'ตู้เย็น ', 'เครื่องทำความเย็น', '01', '002'),
	(34, 'Haier', 'ตู้เย็น ', 'เครื่องทำความเย็น', '01', '002'),
	(35, 'Sonar', 'ตู้เย็น ', 'เครื่องทำความเย็น', '01', '002'),
	(36, 'HomeSun', 'ตู้เย็น ', 'เครื่องทำความเย็น', '01', '002'),
	(37, 'Electrolux', 'ตู้เย็น ', 'เครื่องทำความเย็น', '01', '002'),
	(38, 'Polytron', 'ตู้เย็น ', 'เครื่องทำความเย็น', '01', '002'),
	(39, 'LOV', 'ตู้เย็น ', 'เครื่องทำความเย็น', '01', '002'),
	(40, 'NUFIN', 'ตู้เย็น ', 'เครื่องทำความเย็น', '01', '002'),
	(41, 'Sharp', 'กระติกน้ำร้อน', 'เครื่องทำความร้อน', '02', '003'),
	(42, 'Bear', 'กระติกน้ำร้อน', 'เครื่องทำความร้อน', '02', '003'),
	(43, 'Lovestar', 'กระติกน้ำร้อน', 'เครื่องทำความร้อน', '02', '003'),
	(44, 'ไม่มี', 'กระติกน้ำร้อน', 'เครื่องทำความร้อน', '02', '003'),
	(45, 'Summer', 'กระติกน้ำร้อน', 'เครื่องทำความร้อน', '02', '003'),
	(46, 'Smarthome', 'กระติกน้ำร้อน', 'เครื่องทำความร้อน', '02', '003'),
	(47, 'AJ', 'กระติกน้ำร้อน', 'เครื่องทำความร้อน', '02', '003'),
	(48, 'Kashiwa', 'กระติกน้ำร้อน', 'เครื่องทำความร้อน', '02', '003'),
	(49, 'RRS', 'กระติกน้ำร้อน', 'เครื่องทำความร้อน', '02', '003'),
	(50, 'MITSUMARU', 'กระติกน้ำร้อน', 'เครื่องทำความร้อน', '02', '003'),
	(51, 'Sonar', 'กระติกน้ำร้อน', 'เครื่องทำความร้อน', '02', '003'),
	(52, 'Toshiba', 'กระติกน้ำร้อน', 'เครื่องทำความร้อน', '02', '003'),
	(53, 'Imarflex', 'กระติกน้ำร้อน', 'เครื่องทำความร้อน', '02', '003'),
	(54, 'GetZhop', 'กระติกน้ำร้อน', 'เครื่องทำความร้อน', '02', '003'),
	(55, 'Otto', 'กระติกน้ำร้อน', 'เครื่องทำความร้อน', '02', '003'),
	(56, 'SKG', 'กระติกน้ำร้อน', 'เครื่องทำความร้อน', '02', '003'),
	(57, 'House Worth', 'กระติกน้ำร้อน', 'เครื่องทำความร้อน', '02', '003'),
	(58, 'My Home', 'กระติกน้ำร้อน', 'เครื่องทำความร้อน', '02', '003'),
	(59, 'Hanabishi', 'กระติกน้ำร้อน', 'เครื่องทำความร้อน', '02', '003'),
	(60, 'Sharp', 'หม้อหุงข้าว', 'เครื่องทำความร้อน', '02', '004'),
	(61, 'My Home', 'หม้อหุงข้าว', 'เครื่องทำความร้อน', '02', '004'),
	(62, 'SKG', 'หม้อหุงข้าว', 'เครื่องทำความร้อน', '02', '004'),
	(63, 'Toshiba', 'หม้อหุงข้าว', 'เครื่องทำความร้อน', '02', '004'),
	(64, 'Electrolux', 'หม้อหุงข้าว', 'เครื่องทำความร้อน', '02', '004'),
	(65, 'Panasonic', 'หม้อหุงข้าว', 'เครื่องทำความร้อน', '02', '004'),
	(66, 'Lovestar', 'หม้อหุงข้าว', 'เครื่องทำความร้อน', '02', '004'),
	(67, 'Otto', 'หม้อหุงข้าว', 'เครื่องทำความร้อน', '02', '004'),
	(68, 'ฟิลิปส์', 'หม้อหุงข้าว', 'เครื่องทำความร้อน', '02', '004'),
	(69, 'Unknow', 'หม้อหุงข้าว', 'เครื่องทำความร้อน', '02', '004'),
	(70, 'Kashiwa', 'หม้อหุงข้าว', 'เครื่องทำความร้อน', '02', '004'),
	(71, 'Smarthome', 'หม้อหุงข้าว', 'เครื่องทำความร้อน', '02', '004'),
	(72, 'OXYGEN', 'หม้อหุงข้าว', 'เครื่องทำความร้อน', '02', '004'),
	(73, 'Family', 'หม้อหุงข้าว', 'เครื่องทำความร้อน', '02', '004'),
	(74, 'Hitachi', 'หม้อหุงข้าว', 'เครื่องทำความร้อน', '02', '004'),
	(75, 'Sonar', 'หม้อหุงข้าว', 'เครื่องทำความร้อน', '02', '004'),
	(76, 'Summer', 'หม้อหุงข้าว', 'เครื่องทำความร้อน', '02', '004'),
	(77, 'Smart home', 'หม้อหุงข้าว', 'เครื่องทำความร้อน', '02', '004'),
	(78, 'Misushita', 'หม้อหุงข้าว', 'เครื่องทำความร้อน', '02', '004'),
	(79, 'Casiko', 'หม้อหุงข้าว', 'เครื่องทำความร้อน', '02', '004'),
	(80, 'Stiebel', 'เครื่องทำน้ำอุ่น', 'เครื่องทำความร้อน', '02', '005'),
	(81, 'Sharp', 'เครื่องทำน้ำอุ่น', 'เครื่องทำความร้อน', '02', '005'),
	(82, 'JOVEN', 'เครื่องทำน้ำอุ่น', 'เครื่องทำความร้อน', '02', '005'),
	(83, 'Toshiba', 'เครื่องทำน้ำอุ่น', 'เครื่องทำความร้อน', '02', '005'),
	(84, 'Panasonic', 'เครื่องทำน้ำอุ่น', 'เครื่องทำความร้อน', '02', '005'),
	(85, 'Clarte', 'เครื่องทำน้ำอุ่น', 'เครื่องทำความร้อน', '02', '005'),
	(86, 'MAZUMA', 'เครื่องทำน้ำอุ่น', 'เครื่องทำความร้อน', '02', '005'),
	(87, 'Haier', 'เครื่องทำน้ำอุ่น', 'เครื่องทำความร้อน', '02', '005'),
	(88, 'Electrolux', 'เครื่องทำน้ำอุ่น', 'เครื่องทำความร้อน', '02', '005'),
	(89, 'Hitachi', 'เครื่องทำน้ำอุ่น', 'เครื่องทำความร้อน', '02', '005'),
	(90, 'JTL', 'เครื่องทำน้ำอุ่น', 'เครื่องทำความร้อน', '02', '005'),
	(91, 'MITSUMARU', 'เครื่องทำน้ำอุ่น', 'เครื่องทำความร้อน', '02', '005'),
	(92, 'Astina', 'เครื่องทำน้ำอุ่น', 'เครื่องทำความร้อน', '02', '005'),
	(93, 'Camarcio', 'เครื่องทำน้ำอุ่น', 'เครื่องทำความร้อน', '02', '005'),
	(94, 'Starker', 'เครื่องทำน้ำอุ่น', 'เครื่องทำความร้อน', '02', '005'),
	(95, 'Fagor', 'เครื่องทำน้ำอุ่น', 'เครื่องทำความร้อน', '02', '005'),
	(96, 'Beko', 'เครื่องทำน้ำอุ่น', 'เครื่องทำความร้อน', '02', '005'),
	(97, 'STIEBEL ELTRON', 'เครื่องทำน้ำอุ่น', 'เครื่องทำความร้อน', '02', '005'),
	(98, 'Sharp', 'เตาไมโครเวฟ', 'เครื่องทำความร้อน', '02', '006'),
	(99, 'ซัมซุง', 'เตาไมโครเวฟ', 'เครื่องทำความร้อน', '02', '006'),
	(100, 'Electrolux', 'เตาไมโครเวฟ', 'เครื่องทำความร้อน', '02', '006'),
	(101, 'Toshiba', 'เตาไมโครเวฟ', 'เครื่องทำความร้อน', '02', '006'),
	(102, 'Midea', 'เตาไมโครเวฟ', 'เครื่องทำความร้อน', '02', '006'),
	(103, 'Beko', 'เตาไมโครเวฟ', 'เครื่องทำความร้อน', '02', '006'),
	(104, 'TONGYANG Magic', 'เตาไมโครเวฟ', 'เครื่องทำความร้อน', '02', '006'),
	(105, 'แอลจี', 'เตาไมโครเวฟ', 'เครื่องทำความร้อน', '02', '006'),
	(106, 'Hanabishi', 'กระทะไฟฟ้า', 'เครื่องทำความร้อน', '02', '007'),
	(107, 'Imarflex', 'กระทะไฟฟ้า', 'เครื่องทำความร้อน', '02', '007'),
	(108, 'Otto', 'กระทะไฟฟ้า', 'เครื่องทำความร้อน', '02', '007'),
	(109, 'Konion', 'กระทะไฟฟ้า', 'เครื่องทำความร้อน', '02', '007'),
	(110, 'Smarthome', 'กระทะไฟฟ้า', 'เครื่องทำความร้อน', '02', '007'),
	(111, 'SKG', 'กระทะไฟฟ้า', 'เครื่องทำความร้อน', '02', '007'),
	(112, 'FRY KING', 'กระทะไฟฟ้า', 'เครื่องทำความร้อน', '02', '007'),
	(113, 'Voice', 'กระทะไฟฟ้า', 'เครื่องทำความร้อน', '02', '007'),
	(114, 'DAIWA', 'กระทะไฟฟ้า', 'เครื่องทำความร้อน', '02', '007'),
	(115, 'Toshiba', 'กระทะไฟฟ้า', 'เครื่องทำความร้อน', '02', '007'),
	(116, 'international', 'กระทะไฟฟ้า', 'เครื่องทำความร้อน', '02', '007'),
	(117, 'Family', 'กระทะไฟฟ้า', 'เครื่องทำความร้อน', '02', '007'),
	(118, 'Misushita', 'กระทะไฟฟ้า', 'เครื่องทำความร้อน', '02', '007'),
	(119, 'My Home', 'กระทะไฟฟ้า', 'เครื่องทำความร้อน', '02', '007'),
	(120, 'Tesco', 'กระทะไฟฟ้า', 'เครื่องทำความร้อน', '02', '007'),
	(121, 'MITSUMARU', 'กระทะไฟฟ้า', 'เครื่องทำความร้อน', '02', '007'),
	(122, 'Shangdong', 'กระทะไฟฟ้า', 'เครื่องทำความร้อน', '02', '007'),
	(123, 'OXYGEN', 'กระทะไฟฟ้า', 'เครื่องทำความร้อน', '02', '007'),
	(124, 'Summer', 'กระทะไฟฟ้า', 'เครื่องทำความร้อน', '02', '007'),
	(125, 'AJ', 'กระทะไฟฟ้า', 'เครื่องทำความร้อน', '02', '007'),
	(126, 'กาแล็กซี', 'เครื่องปิ้งขนมปัง', 'เครื่องทำความร้อน', '02', '008'),
	(127, 'FRY KING', 'เครื่องปิ้งขนมปัง', 'เครื่องทำความร้อน', '02', '008'),
	(128, 'Summer', 'เครื่องปิ้งขนมปัง', 'เครื่องทำความร้อน', '02', '008'),
	(129, 'Electrolux', 'เครื่องปิ้งขนมปัง', 'เครื่องทำความร้อน', '02', '008'),
	(130, 'Otto', 'เครื่องปิ้งขนมปัง', 'เครื่องทำความร้อน', '02', '008'),
	(131, 'Imarflex', 'เครื่องปิ้งขนมปัง', 'เครื่องทำความร้อน', '02', '008'),
	(132, 'ไม่มี', 'เครื่องปิ้งขนมปัง', 'เครื่องทำความร้อน', '02', '008'),
	(133, 'AIKO', 'เครื่องปิ้งขนมปัง', 'เครื่องทำความร้อน', '02', '008'),
	(134, 'ฟิลิปส์', 'เครื่องปิ้งขนมปัง', 'เครื่องทำความร้อน', '02', '008'),
	(135, 'Cusino', 'เครื่องปิ้งขนมปัง', 'เครื่องทำความร้อน', '02', '008'),
	(136, 'Sharp', 'เครื่องปิ้งขนมปัง', 'เครื่องทำความร้อน', '02', '008'),
	(137, 'ทีฟาล์ว', 'เครื่องปิ้งขนมปัง', 'เครื่องทำความร้อน', '02', '008'),
	(138, 'OXYGEN', 'เครื่องปิ้งขนมปัง', 'เครื่องทำความร้อน', '02', '008'),
	(139, 'Severin', 'เครื่องปิ้งขนมปัง', 'เครื่องทำความร้อน', '02', '008'),
	(140, 'Russell Hobbs', 'เครื่องปิ้งขนมปัง', 'เครื่องทำความร้อน', '02', '008'),
	(141, 'House Worth', 'เครื่องปิ้งขนมปัง', 'เครื่องทำความร้อน', '02', '008'),
	(142, 'ฟิลิปส์', 'เตารีด', 'เครื่องทำความร้อน', '02', '009'),
	(143, 'ทีฟาล์ว', 'เตารีด', 'เครื่องทำความร้อน', '02', '009'),
	(144, 'Otto', 'เตารีด', 'เครื่องทำความร้อน', '02', '009'),
	(145, 'Sharp', 'เตารีด', 'เครื่องทำความร้อน', '02', '009'),
	(146, 'JOWSUA', 'เตารีด', 'เครื่องทำความร้อน', '02', '009'),
	(147, 'Electrolux', 'เตารีด', 'เครื่องทำความร้อน', '02', '009'),
	(148, 'HETIAN', 'เตารีด', 'เครื่องทำความร้อน', '02', '009'),
	(149, 'Panasonic', 'เตารีด', 'เครื่องทำความร้อน', '02', '009'),
	(150, 'Play Boutique', 'เตารีด', 'เครื่องทำความร้อน', '02', '009'),
	(151, 'Hanabishi', 'เตารีด', 'เครื่องทำความร้อน', '02', '009'),
	(152, 'ไม่มี', 'เตารีด', 'เครื่องทำความร้อน', '02', '009'),
	(153, 'กาแล็กซี', 'เตารีด', 'เครื่องทำความร้อน', '02', '009'),
	(154, 'Smarthome', 'เตารีด', 'เครื่องทำความร้อน', '02', '009'),
	(155, 'Kashiwa', 'เตารีด', 'เครื่องทำความร้อน', '02', '009'),
	(156, 'AIKO', 'เตารีด', 'เครื่องทำความร้อน', '02', '009'),
	(157, 'AJ', 'เตารีด', 'เครื่องทำความร้อน', '02', '009'),
	(158, 'Lovestar', 'เตารีด', 'เครื่องทำความร้อน', '02', '009'),
	(159, 'Tefal Malaysia', 'เตารีด', 'เครื่องทำความร้อน', '02', '009'),
	(160, 'Yuriko', 'เตารีด', 'เครื่องทำความร้อน', '02', '009'),
	(161, 'Positive', 'เตารีด', 'เครื่องทำความร้อน', '02', '009'),
	(162, 'ไม่มี', 'ไฟฉาย', 'ให้แสงสว่าง', '03', '010'),
	(163, 'Alpha', 'ไฟฉาย', 'ให้แสงสว่าง', '03', '010'),
	(164, 'Geonaute', 'ไฟฉาย', 'ให้แสงสว่าง', '03', '010'),
	(165, 'Topmon', 'ไฟฉาย', 'ให้แสงสว่าง', '03', '010'),
	(166, 'Ultrafire', 'ไฟฉาย', 'ให้แสงสว่าง', '03', '010'),
	(167, 'ไม่มี', 'ไฟฉาย', 'ให้แสงสว่าง', '03', '010'),
	(168, 'Jasmin Lights', 'ไฟฉาย', 'ให้แสงสว่าง', '03', '010'),
	(169, 'NUFIN', 'ไฟฉาย', 'ให้แสงสว่าง', '03', '010'),
	(170, 'K-LION', 'ไฟฉาย', 'ให้แสงสว่าง', '03', '010'),
	(171, 'PARAKORN', 'ไฟฉาย', 'ให้แสงสว่าง', '03', '010'),
	(172, 'XtiveGo', 'ไฟฉาย', 'ให้แสงสว่าง', '03', '010'),
	(173, 'Orbia', 'ไฟฉาย', 'ให้แสงสว่าง', '03', '010'),
	(174, 'RAYPAL', 'ไฟฉาย', 'ให้แสงสว่าง', '03', '010'),
	(175, 'Oemgenuine', 'ไฟฉาย', 'ให้แสงสว่าง', '03', '010'),
	(176, 'SKYRAY', 'ไฟฉาย', 'ให้แสงสว่าง', '03', '010'),
	(177, 'Maglite', 'ไฟฉาย', 'ให้แสงสว่าง', '03', '010'),
	(178, 'SUPFIRE', 'ไฟฉาย', 'ให้แสงสว่าง', '03', '010'),
	(179, 'Cree', 'ไฟฉาย', 'ให้แสงสว่าง', '03', '010'),
	(180, 'Telecorsa', 'ไฟฉาย', 'ให้แสงสว่าง', '03', '010'),
	(181, 'Total', 'ไฟฉาย', 'ให้แสงสว่าง', '03', '010'),
	(182, 'ไม่มี', 'หลอดไฟ', 'ให้แสงสว่าง', '03', '011'),
	(183, 'ฟิลิปส์', 'หลอดไฟ', 'ให้แสงสว่าง', '03', '011'),
	(184, 'XinWy', 'หลอดไฟ', 'ให้แสงสว่าง', '03', '011'),
	(185, 'Saneluz', 'หลอดไฟ', 'ให้แสงสว่าง', '03', '011'),
	(186, 'Eve lighting', 'หลอดไฟ', 'ให้แสงสว่าง', '03', '011'),
	(187, 'Light Farm', 'หลอดไฟ', 'ให้แสงสว่าง', '03', '011'),
	(188, 'IWACHI', 'หลอดไฟ', 'ให้แสงสว่าง', '03', '011'),
	(189, 'HI-TEK', 'หลอดไฟ', 'ให้แสงสว่าง', '03', '011'),
	(190, 'BEC', 'หลอดไฟ', 'ให้แสงสว่าง', '03', '011'),
	(191, 'iRemax', 'หลอดไฟ', 'ให้แสงสว่าง', '03', '011'),
	(192, 'Oemgenuine', 'หลอดไฟ', 'ให้แสงสว่าง', '03', '011'),
	(193, 'MP.DC', 'หลอดไฟ', 'ให้แสงสว่าง', '03', '011'),
	(194, 'VeryGoodQ', 'หลอดไฟ', 'ให้แสงสว่าง', '03', '011'),
	(195, 'THE 3 SISTERS', 'หลอดไฟ', 'ให้แสงสว่าง', '03', '011'),
	(196, 'XIGZAG', 'หลอดไฟ', 'ให้แสงสว่าง', '03', '011'),
	(197, 'QQQ', 'หลอดไฟ', 'ให้แสงสว่าง', '03', '011'),
	(198, 'Lamptan', 'หลอดไฟ', 'ให้แสงสว่าง', '03', '011'),
	(199, 'LED Udomsuk', 'หลอดไฟ', 'ให้แสงสว่าง', '03', '011'),
	(200, 'Leon Light', 'หลอดไฟ', 'ให้แสงสว่าง', '03', '011'),
	(201, 'Greenlight', 'หลอดไฟ', 'ให้แสงสว่าง', '03', '011'),
	(202, 'ซัมซุง', 'โทรทัศน์', 'ให้ความบันเทิง', '04', '012'),
	(203, 'Sharp', 'โทรทัศน์', 'ให้ความบันเทิง', '04', '012'),
	(204, 'แอลจี', 'โทรทัศน์', 'ให้ความบันเทิง', '04', '012'),
	(205, 'Aconatic', 'โทรทัศน์', 'ให้ความบันเทิง', '04', '012'),
	(206, 'ABISU', 'โทรทัศน์', 'ให้ความบันเทิง', '04', '012'),
	(207, 'Sonar', 'โทรทัศน์', 'ให้ความบันเทิง', '04', '012'),
	(208, 'Tesco', 'โทรทัศน์', 'ให้ความบันเทิง', '04', '012'),
	(209, 'Sony', 'โทรทัศน์', 'ให้ความบันเทิง', '04', '012'),
	(210, 'ฟิลิปส์', 'โทรทัศน์', 'ให้ความบันเทิง', '04', '012'),
	(211, 'ALTRON', 'โทรทัศน์', 'ให้ความบันเทิง', '04', '012'),
	(212, 'Provision', 'โทรทัศน์', 'ให้ความบันเทิง', '04', '012'),
	(213, 'TCL', 'โทรทัศน์', 'ให้ความบันเทิง', '04', '012'),
	(214, 'Prisma', 'โทรทัศน์', 'ให้ความบันเทิง', '04', '012'),
	(215, 'RECHO', 'โทรทัศน์', 'ให้ความบันเทิง', '04', '012'),
	(216, 'i-View', 'โทรทัศน์', 'ให้ความบันเทิง', '04', '012'),
	(217, 'Panasonic', 'โทรทัศน์', 'ให้ความบันเทิง', '04', '012'),
	(218, 'SKG', 'โทรทัศน์', 'ให้ความบันเทิง', '04', '012'),
	(219, 'Mitron', 'โทรทัศน์', 'ให้ความบันเทิง', '04', '012'),
	(220, 'Hisense', 'โทรทัศน์', 'ให้ความบันเทิง', '04', '012'),
	(221, 'Skyworth', 'โทรทัศน์', 'ให้ความบันเทิง', '04', '012'),
	(222, 'ไม่มี', 'สเตอริโอ', 'ให้ความบันเทิง', '04', '013'),
	(223, 'บลูทูธ', 'สเตอริโอ', 'ให้ความบันเทิง', '04', '013'),
	(224, 'Sony', 'สเตอริโอ', 'ให้ความบันเทิง', '04', '013'),
	(225, 'Panasonic', 'สเตอริโอ', 'ให้ความบันเทิง', '04', '013'),
	(226, 'แอลจี', 'สเตอริโอ', 'ให้ความบันเทิง', '04', '013'),
	(227, 'A-ONE', 'สเตอริโอ', 'ให้ความบันเทิง', '04', '013'),
	(228, 'MODIVOX', 'สเตอริโอ', 'ให้ความบันเทิง', '04', '013'),
	(229, 'Microlab', 'สเตอริโอ', 'ให้ความบันเทิง', '04', '013'),
	(230, 'Bose', 'สเตอริโอ', 'ให้ความบันเทิง', '04', '013'),
	(231, 'Nobsound', 'สเตอริโอ', 'ให้ความบันเทิง', '04', '013'),
	(232, 'AJ', 'สเตอริโอ', 'ให้ความบันเทิง', '04', '013'),
	(233, 'Yamaha', 'สเตอริโอ', 'ให้ความบันเทิง', '04', '013'),
	(234, 'SKG', 'สเตอริโอ', 'ให้ความบันเทิง', '04', '013'),
	(235, 'Sonos', 'สเตอริโอ', 'ให้ความบันเทิง', '04', '013'),
	(236, 'Onkyo', 'สเตอริโอ', 'ให้ความบันเทิง', '04', '013'),
	(237, 'Denon', 'สเตอริโอ', 'ให้ความบันเทิง', '04', '013'),
	(238, 'Sherman', 'สเตอริโอ', 'ให้ความบันเทิง', '04', '013'),
	(239, 'SOKE', 'สเตอริโอ', 'ให้ความบันเทิง', '04', '013'),
	(240, 'GXL', 'สเตอริโอ', 'ให้ความบันเทิง', '04', '013'),
	(241, 'ROTEL', 'สเตอริโอ', 'ให้ความบันเทิง', '04', '013'),
	(242, 'ไม่มี', 'คอมพิวเตอร์', 'ให้ความบันเทิง', '04', '014'),
	(243, 'Canon', 'คอมพิวเตอร์', 'ให้ความบันเทิง', '04', '014'),
	(244, 'เอชพี', 'คอมพิวเตอร์', 'ให้ความบันเทิง', '04', '014'),
	(245, 'VAKIND', 'คอมพิวเตอร์', 'ให้ความบันเทิง', '04', '014'),
	(246, 'Fuji Xerox', 'คอมพิวเตอร์', 'ให้ความบันเทิง', '04', '014'),
	(247, 'Kingston', 'คอมพิวเตอร์', 'ให้ความบันเทิง', '04', '014'),
	(248, 'Acer', 'คอมพิวเตอร์', 'ให้ความบันเทิง', '04', '014'),
	(249, 'Intel', 'คอมพิวเตอร์', 'ให้ความบันเทิง', '04', '014'),
	(250, 'Best Toner', 'คอมพิวเตอร์', 'ให้ความบันเทิง', '04', '014'),
	(251, 'Wifi', 'คอมพิวเตอร์', 'ให้ความบันเทิง', '04', '014'),
	(252, 'Color Box', 'คอมพิวเตอร์', 'ให้ความบันเทิง', '04', '014'),
	(253, 'เวสเทิร์นดิจิตอล', 'คอมพิวเตอร์', 'ให้ความบันเทิง', '04', '014'),
	(254, 'Best 4 U', 'คอมพิวเตอร์', 'ให้ความบันเทิง', '04', '014'),
	(255, 'เลโนโว่', 'คอมพิวเตอร์', 'ให้ความบันเทิง', '04', '014'),
	(256, '65SmartTools', 'คอมพิวเตอร์', 'ให้ความบันเทิง', '04', '014'),
	(257, 'ASUS', 'คอมพิวเตอร์', 'ให้ความบันเทิง', '04', '014'),
	(258, 'COMPATIBLE', 'คอมพิวเตอร์', 'ให้ความบันเทิง', '04', '014'),
	(259, 'Brother', 'คอมพิวเตอร์', 'ให้ความบันเทิง', '04', '014'),
	(260, 'Fast Toner', 'คอมพิวเตอร์', 'ให้ความบันเทิง', '04', '014'),
	(261, 'Hatari', 'พัดลม', 'มอเตอร์และสายพาน', '05', '015'),
	(262, 'Eloop', 'พัดลม', 'มอเตอร์และสายพาน', '05', '015'),
	(263, 'ไม่มี', 'พัดลม', 'มอเตอร์และสายพาน', '05', '015'),
	(264, 'Imarflex', 'พัดลม', 'มอเตอร์และสายพาน', '05', '015'),
	(265, 'MIRA', 'พัดลม', 'มอเตอร์และสายพาน', '05', '015'),
	(266, 'Victor', 'พัดลม', 'มอเตอร์และสายพาน', '05', '015'),
	(267, 'AIKO', 'พัดลม', 'มอเตอร์และสายพาน', '05', '015'),
	(268, 'Clarte', 'พัดลม', 'มอเตอร์และสายพาน', '05', '015'),
	(269, 'Lucky Misu', 'พัดลม', 'มอเตอร์และสายพาน', '05', '015'),
	(270, 'Mitsubishi', 'พัดลม', 'มอเตอร์และสายพาน', '05', '015'),
	(271, 'Kashiwa', 'พัดลม', 'มอเตอร์และสายพาน', '05', '015'),
	(272, 'Remax', 'พัดลม', 'มอเตอร์และสายพาน', '05', '015'),
	(273, 'TKspyShop', 'พัดลม', 'มอเตอร์และสายพาน', '05', '015'),
	(274, 'Sharp', 'พัดลม', 'มอเตอร์และสายพาน', '05', '015'),
	(275, '1Choice', 'พัดลม', 'มอเตอร์และสายพาน', '05', '015'),
	(276, 'TAIFIT', 'พัดลม', 'มอเตอร์และสายพาน', '05', '015'),
	(277, 'Portable cooler', 'พัดลม', 'มอเตอร์และสายพาน', '05', '015'),
	(278, 'CLEO', 'พัดลม', 'มอเตอร์และสายพาน', '05', '015'),
	(279, 'Panasonic', 'พัดลม', 'มอเตอร์และสายพาน', '05', '015'),
	(280, 'Person', 'พัดลม', 'มอเตอร์และสายพาน', '05', '015'),
	(281, 'ซัมซุง', 'เครื่องซักผ้า', 'มอเตอร์และสายพาน', '05', '016'),
	(282, 'แอลจี', 'เครื่องซักผ้า', 'มอเตอร์และสายพาน', '05', '016'),
	(283, 'Haier', 'เครื่องซักผ้า', 'มอเตอร์และสายพาน', '05', '016'),
	(284, 'Panasonic', 'เครื่องซักผ้า', 'มอเตอร์และสายพาน', '05', '016'),
	(285, 'พลาสมา', 'เครื่องซักผ้า', 'มอเตอร์และสายพาน', '05', '016'),
	(286, 'Konion', 'เครื่องซักผ้า', 'มอเตอร์และสายพาน', '05', '016'),
	(287, 'Toshiba', 'เครื่องซักผ้า', 'มอเตอร์และสายพาน', '05', '016'),
	(288, 'TIGER', 'เครื่องซักผ้า', 'มอเตอร์และสายพาน', '05', '016'),
	(289, 'Aigo', 'เครื่องซักผ้า', 'มอเตอร์และสายพาน', '05', '016'),
	(290, 'Sonar', 'เครื่องซักผ้า', 'มอเตอร์และสายพาน', '05', '016'),
	(291, 'ecio', 'เครื่องซักผ้า', 'มอเตอร์และสายพาน', '05', '016'),
	(292, 'Sharp', 'เครื่องซักผ้า', 'มอเตอร์และสายพาน', '05', '016'),
	(293, 'Smarthome', 'เครื่องซักผ้า', 'มอเตอร์และสายพาน', '05', '016'),
	(294, 'Electrolux', 'เครื่องซักผ้า', 'มอเตอร์และสายพาน', '05', '016'),
	(295, 'Hitachi', 'เครื่องซักผ้า', 'มอเตอร์และสายพาน', '05', '016'),
	(296, 'Imarflex', 'เครื่องซักผ้า', 'มอเตอร์และสายพาน', '05', '016'),
	(297, 'Meier', 'เครื่องซักผ้า', 'มอเตอร์และสายพาน', '05', '016'),
	(298, 'NEO', 'เครื่องซักผ้า', 'มอเตอร์และสายพาน', '05', '016'),
	(299, 'ShopSmart', 'เครื่องซักผ้า', 'มอเตอร์และสายพาน', '05', '016'),
	(300, 'ไม่มี', 'เครื่องซักผ้า', 'มอเตอร์และสายพาน', '05', '016'),
	(301, 'ฟิลิปส์', 'เครื่องปั่นผลไม้', 'มอเตอร์และสายพาน', '05', '017'),
	(302, 'Summer', 'เครื่องปั่นผลไม้', 'มอเตอร์และสายพาน', '05', '017'),
	(303, 'Otto', 'เครื่องปั่นผลไม้', 'มอเตอร์และสายพาน', '05', '017'),
	(304, 'Play Boutique', 'เครื่องปั่นผลไม้', 'มอเตอร์และสายพาน', '05', '017'),
	(305, 'ไม่มี', 'เครื่องปั่นผลไม้', 'มอเตอร์และสายพาน', '05', '017'),
	(306, 'Yuriko', 'เครื่องปั่นผลไม้', 'มอเตอร์และสายพาน', '05', '017'),
	(307, 'Smarthome', 'เครื่องปั่นผลไม้', 'มอเตอร์และสายพาน', '05', '017'),
	(308, 'As Seen On TV', 'เครื่องปั่นผลไม้', 'มอเตอร์และสายพาน', '05', '017'),
	(309, 'Sonar', 'เครื่องปั่นผลไม้', 'มอเตอร์และสายพาน', '05', '017'),
	(310, 'Sharp', 'เครื่องปั่นผลไม้', 'มอเตอร์และสายพาน', '05', '017'),
	(311, 'nutribullet', 'เครื่องปั่นผลไม้', 'มอเตอร์และสายพาน', '05', '017'),
	(312, 'Panasonic', 'เครื่องปั่นผลไม้', 'มอเตอร์และสายพาน', '05', '017'),
	(313, 'Letshop', 'เครื่องปั่นผลไม้', 'มอเตอร์และสายพาน', '05', '017'),
	(314, 'AJ', 'เครื่องปั่นผลไม้', 'มอเตอร์และสายพาน', '05', '017'),
	(315, 'Dude Shop', 'เครื่องปั่นผลไม้', 'มอเตอร์และสายพาน', '05', '017'),
	(316, 'Electrolux', 'เครื่องปั่นผลไม้', 'มอเตอร์และสายพาน', '05', '017'),
	(317, 'ทีฟาล์ว', 'เครื่องปั่นผลไม้', 'มอเตอร์และสายพาน', '05', '017'),
	(318, 'Shake & Take', 'เครื่องปั่นผลไม้', 'มอเตอร์และสายพาน', '05', '017'),
	(319, 'ไม่มี', 'เครื่องดูดฝุ่น', 'มอเตอร์และสายพาน', '05', '018'),
	(320, 'louis will', 'เครื่องดูดฝุ่น', 'มอเตอร์และสายพาน', '05', '018'),
	(321, 'CLEO', 'เครื่องดูดฝุ่น', 'มอเตอร์และสายพาน', '05', '018'),
	(322, 'Otto', 'เครื่องดูดฝุ่น', 'มอเตอร์และสายพาน', '05', '018'),
	(323, 'ซัมซุง', 'เครื่องดูดฝุ่น', 'มอเตอร์และสายพาน', '05', '018'),
	(324, 'Sharp', 'เครื่องดูดฝุ่น', 'มอเตอร์และสายพาน', '05', '018'),
	(325, 'Imarflex', 'เครื่องดูดฝุ่น', 'มอเตอร์และสายพาน', '05', '018'),
	(326, 'ZT', 'เครื่องดูดฝุ่น', 'มอเตอร์และสายพาน', '05', '018'),
	(327, 'มิสเตอร์ โรบอท', 'เครื่องดูดฝุ่น', 'มอเตอร์และสายพาน', '05', '018'),
	(328, 'Electrolux', 'เครื่องดูดฝุ่น', 'มอเตอร์และสายพาน', '05', '018'),
	(329, 'JOWSUA', 'เครื่องดูดฝุ่น', 'มอเตอร์และสายพาน', '05', '018'),
	(330, 'Black & Decker', 'เครื่องดูดฝุ่น', 'มอเตอร์และสายพาน', '05', '018'),
	(331, 'HOMIE', 'เครื่องดูดฝุ่น', 'มอเตอร์และสายพาน', '05', '018'),
	(332, 'HHsociety', 'เครื่องดูดฝุ่น', 'มอเตอร์และสายพาน', '05', '018'),
	(333, 'Autobot', 'เครื่องดูดฝุ่น', 'มอเตอร์และสายพาน', '05', '018'),
	(334, 'Elit', 'เครื่องดูดฝุ่น', 'มอเตอร์และสายพาน', '05', '018'),
	(335, 'VAKIND', 'เครื่องดูดฝุ่น', 'มอเตอร์และสายพาน', '05', '018'),
	(336, 'ฟิลิปส์', 'เครื่องดูดฝุ่น', 'มอเตอร์และสายพาน', '05', '018'),
	(337, 'BEST', 'เครื่องดูดฝุ่น', 'มอเตอร์และสายพาน', '05', '018'),
	(338, 'Hitachi', 'เครื่องดูดฝุ่น', 'มอเตอร์และสายพาน', '05', '018');
/*!40000 ALTER TABLE `type_brand` ENABLE KEYS */;

-- Dumping structure for table amnuay.type_product
CREATE TABLE IF NOT EXISTS `type_product` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `product` varchar(50) DEFAULT NULL,
  `appliances` varchar(50) DEFAULT NULL,
  `appliances_id` varchar(50) DEFAULT NULL,
  `product_id` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=19 DEFAULT CHARSET=utf8;

-- Dumping data for table amnuay.type_product: ~18 rows (approximately)
/*!40000 ALTER TABLE `type_product` DISABLE KEYS */;
INSERT INTO `type_product` (`id`, `product`, `appliances`, `appliances_id`, `product_id`) VALUES
	(1, 'แอร์', 'เครื่องทำความเย็น', '01', '001'),
	(2, 'ตู้เย็น ', 'เครื่องทำความเย็น', '01', '002'),
	(3, 'กระติกน้ำร้อน', 'เครื่องทำความร้อน', '02', '003'),
	(4, 'หม้อหุงข้าว', 'เครื่องทำความร้อน', '02', '004'),
	(5, 'เครื่องทำน้ำอุ่น', 'เครื่องทำความร้อน', '02', '005'),
	(6, 'เตาไมโครเวฟ', 'เครื่องทำความร้อน', '02', '006'),
	(7, 'กระทะไฟฟ้า', 'เครื่องทำความร้อน', '02', '007'),
	(8, 'เครื่องปิ้งขนมปัง', 'เครื่องทำความร้อน', '02', '008'),
	(9, 'เตารีด', 'เครื่องทำความร้อน', '02', '009'),
	(10, 'ไฟฉาย', 'ให้แสงสว่าง', '03', '010'),
	(11, 'หลอดไฟ', 'ให้แสงสว่าง', '03', '011'),
	(12, 'โทรทัศน์', 'ให้ความบันเทิง', '04', '012'),
	(13, 'สเตอริโอ', 'ให้ความบันเทิง', '04', '013'),
	(14, 'คอมพิวเตอร์', 'ให้ความบันเทิง', '04', '014'),
	(15, 'พัดลม', 'มอเตอร์และสายพาน', '05', '015'),
	(16, 'เครื่องซักผ้า', 'มอเตอร์และสายพาน', '05', '016'),
	(17, 'เครื่องปั่นผลไม้', 'มอเตอร์และสายพาน', '05', '017'),
	(18, 'เครื่องดูดฝุ่น', 'มอเตอร์และสายพาน', '05', '018');
/*!40000 ALTER TABLE `type_product` ENABLE KEYS */;

-- Dumping structure for table amnuay.warranty
CREATE TABLE IF NOT EXISTS `warranty` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `date` date DEFAULT NULL,
  `product_code` varchar(50) DEFAULT NULL,
  `product_name` varchar(50) DEFAULT NULL,
  `serial_number` varchar(50) DEFAULT NULL,
  `warranty` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;

-- Dumping data for table amnuay.warranty: ~2 rows (approximately)
/*!40000 ALTER TABLE `warranty` DISABLE KEYS */;
INSERT INTO `warranty` (`id`, `date`, `product_code`, `product_name`, `serial_number`, `warranty`) VALUES
	(1, '2018-06-10', 'WTL95019', 'BEKO เครื่องซักผ้าฝาบน (9.5 กก.)', 'WTL95019', ' 2-Y'),
	(2, '2018-05-21', 'GL553VD-DM1006', 'NOTEBOOK ASUS ROG GL553VD-DM1006/i7-7700HQ,GTX1050', 'H8N0CV07N38933E', ' 2-Y');
/*!40000 ALTER TABLE `warranty` ENABLE KEYS */;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IF(@OLD_FOREIGN_KEY_CHECKS IS NULL, 1, @OLD_FOREIGN_KEY_CHECKS) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
